texts = {
    "start": {
        "choose_language": "Выберите язык 👇",
        "language_selected": "Вы выбрали Русский язык ✅"
    },

    "menu": {
        "main": "🏠 Главное меню",
        "catalog_clicked": "📦 Каталог открыт",
        "login_clicked": "🔑 Вход",
        "register_clicked": "📝 Регистрация",
        "back": "↩️ Назад",
        "back_to_catalog": "↩️ Назад к каталогу",
        "cart": "Корзина",
        "title": "🗂 Меню",
        "catalog": "📦 Каталог",
        "profile": "Профиль",
        "orders": "Мои заказы",
        "help": "Помощь",
    },

    "register": {
        "ask_contact": "📧 Пожалуйста, введите вашу электронную почту или номер телефона:",
        "invalid_format": "⚠️ Неверный формат! Введите корректный email или номер телефона.",
        "sending": "⏳ Отправка данных, пожалуйста подождите...",
        "enter_otp": "🔢 Введите 4-значный код, отправленный вам:",
        "otp_invalid": "⚠️ Неверный формат OTP (нужно 4 цифры). Попробуйте снова.",
        "verifying": "⏳ Проверка кода...",
        "verified": "✅ Код подтвержден! Вы успешно вошли.",
        "verify_failed": "❌ {error} Попробуйте снова:",
        "server_error": "❌ Ошибка сервера (код: {code}).\n{error}",
        "exception": "🚫 Вы уже зарегистрированы. Выполните вход.",
        "ask_password": "Пожалуйста, введите новый пароль:",
        "ask_first_name": "Пожалуйста, введите ваше имя:",
        "name_empty": "Имя не может быть пустым.",
        "password_empty": "Пароль не может быть пустым.",
        "success": "✅ Вы успешно зарегистрировались!",
        "password_failed": "Произошла ошибка"
    },

    "login": {
        "ask_contact": "📧 Введите ваш зарегистрированный email или номер телефона:",
        "ask_password": "🔑 Введите ваш пароль:",
        "sending": "⏳ Отправка данных, пожалуйста подождите...",
        "success": "✅ Вы успешно вошли в систему!",
        "failed": "❌ Ошибка входа: {error}",
        "exception": "🚫 Неверный логин или пароль"
    },

    "catalog": {
        "send_location": "Чтобы показать расстояние до продуктов, отправьте вашу геолокацию.",
        "location": "📍 Отправить геолокацию",
        "location_saved": "📍 Геолокация сохранена!",
        "choose_category": "Выберите раздел каталога:",
        "empty": "В этой категории нет продуктов.",
        "category_title": "Категория: {cat}",
        "superbox": "Surprise Bag",
        "update_location": "📍 Обновить геолокацию",
        "fetch_error": "❌ Ошибка при получении данных:",
        "api_error": "❌ Некорректный ответ от API. Обратитесь к администратору.",
        "superbox_title": "🎁 Surprise Bag",

        "empty_superbox": "❌ Нет доступных товаров ни в одном разделе.",
        "choose_superbox_section": "🎁 Выберите раздел Surprise Bag:",
        "section_popular": "Популярные",
        "section_recommended": "Рекомендуемые",
        "section_new": "Новые",
        "section_tomorrow": "На завтра",
        "section_collect_for_now": "Можно забрать сейчас",
        "section_morning": "Утро",
        "section_afternoon": "День",
        "section_evening": "Вечер",
    },

    "product": {
        "max_qty": "❗ Не может превышать {max_count}!",
        "description": "Описание",
        "price": "Цена",
        "quantity": "Количество",
        "distance": "Расстояние",
        "rating": "Рейтинг",
        "pickup_time": "Время забора",
        "branch": "Филиал",
        "add_to_cart": "🛒 Добавить в корзину",
        "increase": "➕ Увеличить",
        "decrease": "➖ Уменьшить",
        "back_to_list": "↩️ Назад к списку",
        "not_found": "Товар не найден"
    },

    "cart": {
        "empty": "🛒 Корзина пуста.",
        "warning": "❗ Количество не может быть меньше 1",
        "empty_hint": "Пока нет добавленных товаров.",
        "title": "🛒 Товары в корзине",
        "view": "🛒 Корзина",
        "total": "Итого",
        "grand_total": "Общая сумма",
        "checkout": "✅ Оформить заказ",
        "clear": "🗑 Очистить",
        "added": "✅ Товар добавлен в корзину",
        "delete_confirm": "будет удалён.",
        "no_undo": "Это действие необратимо.",
        "delete": "❌ Удалить",
        "delete_yes": "✅ Да",
        "delete_no": "❌ Нет"
    },

    "order": {
        "summary": "📝 Детали заказа",
        "confirm": "✅ Подтвердить",
        "success": "✅ Ваш заказ успешно принят!",
        "payment_process": "Процесс оплаты",
        "payment_hint": "Нажмите кнопку ниже, чтобы оплатить:",
        "payment_button": "💳 Оплатить",
        "payment_redirect": "✅ Заказ создан.\nТеперь выполните оплату:",
        "error": "❌ Ошибка при создании заказа.",
        "pay": "Оплатить",
        "payment_click": "💳 Click",
        "payment_payme": "💳 Payme",
    },

    "pagination": {
        "prev": "⬅️ Предыдущая",
        "next": "Следующая ➡️",
        "page": "{page}-страница",
    },

    "profile": {
        "title": "Информация профиля",
        "id": "ID пользователя",
        "first_name": "Имя",
        "last_name": "Фамилия",
        "email": "Email",
        "birth_date": "Дата рождения",
        "phone": "Номер телефона",
        "token_expired": "🔐 Срок действия токена истёк, выполните вход снова.",
        "no_token": "❌ Вы ещё не вошли в систему.",
        "error": "🚫 Произошла ошибка: {error}",
        "edit": "✏️ Редактировать профиль",
        "change_lang": "🌐 Изменить язык",
        "changed_lang": "✅ Язык успешно изменён!",
    },

    "profile_buttons": {
        "edit": "✏️ Редактировать данные",
        "lang": "🌐 Изменить язык",
        "back": "↩️ Назад"
    },

    "profile_edit": {
        "choose_field": "Какую информацию вы хотите изменить?",
        "enter_first_name": "✏️ Введите новое имя:",
        "enter_last_name": "✏️ Введите новую фамилию:",
        "enter_email": "📧 Введите новый email:",
        "enter_birth_date": "🎂 Введите дату рождения (ГГГГ-ММ-ДД):",
        "enter_phone": "📱 Введите новый номер телефона:",
        "enter_password": "🔐 Введите новый пароль:",
        "updated_field": "✅ Информация успешно обновлена!",
        "password": "🔐 Пароль"
    },

    "orders": {
        "title": "📦 Ваши заказы:",
        "empty": "📭 У вас пока нет заказов.",
        "status": "Статус",
        "pickup_date": "Дата получения",
        "pickup_time": "Время получения",
        "branch": "Филиал",
        "select_number": "Нажмите один из следующих номеров",
        "back": "Назад",
        "next": "Далее",
        "menu": "Вернуться в меню",
        "detail_title": "Детали заказа",
        "total_price": "Общая сумма",
        "history_empty": "История заказов пуста.",
        "history_title": "История заказов",
        "date": "Дата",
        "qr": "QR-код",
    },

    "order_status": {
        "pending": "⌛ В процессе",
        "ready": "✅ Готово",
        "cancelled": "Отменено",
        "unknown": "Неизвестно"
    },

    "help": {
        "text": "📧 Email: {email}\nОтправьте ваши вопросы на этот адрес.\nНаша команда свяжется с вами как можно быстрее."
    }
}
